PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/devices/include/ip/cyip_srss.h
/* CLK_DPLL_HP.CONFIG */
#define CLK_DPLL_HP_CONFIG_PLL_FREQ_NDIV_INT_SEL_Pos 0UL
#define CLK_DPLL_HP_CONFIG_PLL_FREQ_NDIV_INT_SEL_Msk 0xFFUL
#define CLK_DPLL_HP_CONFIG_PLL_FREQ_PDIV_SEL_Pos 8UL
#define CLK_DPLL_HP_CONFIG_PLL_FREQ_PDIV_SEL_Msk 0x700UL
#define CLK_DPLL_HP_CONFIG_PLL_FREQ_KDIV_SEL_Pos 12UL
#define CLK_DPLL_HP_CONFIG_PLL_FREQ_KDIV_SEL_Msk 0x7000UL
#define CLK_DPLL_HP_CONFIG_BYPASS_SEL_Pos       28UL
#define CLK_DPLL_HP_CONFIG_BYPASS_SEL_Msk       0x30000000UL
#define CLK_DPLL_HP_CONFIG_ENABLE_Pos           31UL
#define CLK_DPLL_HP_CONFIG_ENABLE_Msk           0x80000000UL
/* CLK_DPLL_HP.CONFIG2 */
#define CLK_DPLL_HP_CONFIG2_PLL_FREQ_NDIV_FRACT_SEL_Pos 0UL
#define CLK_DPLL_HP_CONFIG2_PLL_FREQ_NDIV_FRACT_SEL_Msk 0x1FFFFFUL
#define CLK_DPLL_HP_CONFIG2_PLL_FREQ_MODE_SEL_Pos 21UL
#define CLK_DPLL_HP_CONFIG2_PLL_FREQ_MODE_SEL_Msk 0xE00000UL
#define CLK_DPLL_HP_CONFIG2_PLL_IVR_TRIM_Pos    24UL
#define CLK_DPLL_HP_CONFIG2_PLL_IVR_TRIM_Msk    0xF000000UL
/* CLK_DPLL_HP.CONFIG3 */
#define CLK_DPLL_HP_CONFIG3_PLL_CLKR_SEL_Pos    0UL
#define CLK_DPLL_HP_CONFIG3_PLL_CLKR_SEL_Msk    0x1UL
#define CLK_DPLL_HP_CONFIG3_PLL_FDSM_SEL_Pos    29UL
#define CLK_DPLL_HP_CONFIG3_PLL_FDSM_SEL_Msk    0x20000000UL
/* CLK_DPLL_HP.CONFIG4 */
#define CLK_DPLL_HP_CONFIG4_PLL_LF_LC_ALPHA_Pos 0UL
#define CLK_DPLL_HP_CONFIG4_PLL_LF_LC_ALPHA_Msk 0x1FUL
#define CLK_DPLL_HP_CONFIG4_PLL_LF_LC_BETA_Pos  5UL
#define CLK_DPLL_HP_CONFIG4_PLL_LF_LC_BETA_Msk  0x3E0UL
#define CLK_DPLL_HP_CONFIG4_PLL_FLOCK_EN_THRESH_Pos 11UL
#define CLK_DPLL_HP_CONFIG4_PLL_FLOCK_EN_THRESH_Msk 0x3800UL
#define CLK_DPLL_HP_CONFIG4_PLL_FLOCK_WAITPER_Pos 16UL
#define CLK_DPLL_HP_CONFIG4_PLL_FLOCK_WAITPER_Msk 0xF0000UL
#define CLK_DPLL_HP_CONFIG4_PLL_FLOCK_LK_THRESH_Pos 20UL
#define CLK_DPLL_HP_CONFIG4_PLL_FLOCK_LK_THRESH_Msk 0x700000UL
#define CLK_DPLL_HP_CONFIG4_PLL_FLOCK_LK_WAITPER_Pos 23UL
#define CLK_DPLL_HP_CONFIG4_PLL_FLOCK_LK_WAITPER_Msk 0x7800000UL
#define CLK_DPLL_HP_CONFIG4_PLL_FLOCK_OBSWIN_Pos 27UL
#define CLK_DPLL_HP_CONFIG4_PLL_FLOCK_OBSWIN_Msk 0x78000000UL
/* CLK_DPLL_HP.CONFIG5 */
#define CLK_DPLL_HP_CONFIG5_PLL_LF_ALPHA_Pos    0UL
#define CLK_DPLL_HP_CONFIG5_PLL_LF_ALPHA_Msk    0x1FUL
#define CLK_DPLL_HP_CONFIG5_PLL_LF_BETA_Pos     5UL
#define CLK_DPLL_HP_CONFIG5_PLL_LF_BETA_Msk     0x3E0UL
#define CLK_DPLL_HP_CONFIG5_PLL_LF_SET_PARAMS_Pos 12UL
#define CLK_DPLL_HP_CONFIG5_PLL_LF_SET_PARAMS_Msk 0x1000UL
#define CLK_DPLL_HP_CONFIG5_PLL_DT_CAL_DIG_Pos  16UL
#define CLK_DPLL_HP_CONFIG5_PLL_DT_CAL_DIG_Msk  0x1FFF0000UL
/* CLK_DPLL_HP.TRIGMOD */
#define CLK_DPLL_HP_TRIGMOD_PLL_TRIMOD_FREQ_Pos 0UL
#define CLK_DPLL_HP_TRIGMOD_PLL_TRIMOD_FREQ_Msk 0xFFFFUL
#define CLK_DPLL_HP_TRIGMOD_PLL_TRIMOD_GRD_Pos  16UL
#define CLK_DPLL_HP_TRIGMOD_PLL_TRIMOD_GRD_Msk  0xFFFF0000UL
/* CLK_DPLL_HP.TRIGMOD2 */
#define CLK_DPLL_HP_TRIGMOD2_PLL_TRIMOD_RATE_Pos 0UL
#define CLK_DPLL_HP_TRIGMOD2_PLL_TRIMOD_RATE_Msk 0x7FFFFUL
#define CLK_DPLL_HP_TRIGMOD2_PLL_TRIMOD_EN_Pos  20UL
#define CLK_DPLL_HP_TRIGMOD2_PLL_TRIMOD_EN_Msk  0x100000UL
#define CLK_DPLL_HP_TRIGMOD2_PLL_TRIMOD_STP_Pos 24UL
#define CLK_DPLL_HP_TRIGMOD2_PLL_TRIMOD_STP_Msk 0x1000000UL
/* CLK_DPLL_HP.STATUS */
#define CLK_DPLL_HP_STATUS_LOCKED_Pos           0UL
#define CLK_DPLL_HP_STATUS_LOCKED_Msk           0x1UL
#define CLK_DPLL_HP_STATUS_UNLOCK_OCCURRED_Pos  1UL
#define CLK_DPLL_HP_STATUS_UNLOCK_OCCURRED_Msk  0x2UL
#define CLK_DPLL_HP_STATUS_PLL_LOCKDET_RES_Pos  16UL
#define CLK_DPLL_HP_STATUS_PLL_LOCKDET_RES_Msk  0x10000UL
#define CLK_DPLL_HP_STATUS_PLL_LOCKDET_RES_ACK_Pos 20UL
#define CLK_DPLL_HP_STATUS_PLL_LOCKDET_RES_ACK_Msk 0x100000UL
/* CLK_DPLL_HP.DUTYCAL_CTRL */
#define CLK_DPLL_HP_DUTYCAL_CTRL_PLL_DUTYCAL_DELTA_Pos 0UL
#define CLK_DPLL_HP_DUTYCAL_CTRL_PLL_DUTYCAL_DELTA_Msk 0x7UL
#define CLK_DPLL_HP_DUTYCAL_CTRL_PLL_DUTY_CAL_RATIO_OK_Pos 3UL
#define CLK_DPLL_HP_DUTYCAL_CTRL_PLL_DUTY_CAL_RATIO_OK_Msk 0x8UL
#define CLK_DPLL_HP_DUTYCAL_CTRL_PLL_DUTY_CAL_OK_Pos 4UL
#define CLK_DPLL_HP_DUTYCAL_CTRL_PLL_DUTY_CAL_OK_Msk 0x10UL
#define CLK_DPLL_HP_DUTYCAL_CTRL_PLL_DUTYCAL_TARGET_Pos 16UL
#define CLK_DPLL_HP_DUTYCAL_CTRL_PLL_DUTYCAL_TARGET_Msk 0x1FFF0000UL
#define CLK_DPLL_HP_DUTYCAL_CTRL_PLL_DUTYCAL_CTRL_RG_EN_Pos 29UL
#define CLK_DPLL_HP_DUTYCAL_CTRL_PLL_DUTYCAL_CTRL_RG_EN_Msk 0x20000000UL
#define CLK_DPLL_HP_DUTYCAL_CTRL_PLL_DUTYCAL_EN_Pos 31UL
#define CLK_DPLL_HP_DUTYCAL_CTRL_PLL_DUTYCAL_EN_Msk 0x80000000UL


/* RAM_TRIM.TRIM_RAM_CTL */
#define RAM_TRIM_TRIM_RAM_CTL_TRIM_Pos          0UL
#define RAM_TRIM_TRIM_RAM_CTL_TRIM_Msk          0xFFFFFFFFUL


/* WDT.CTL */
#define WDT_CTL_ENABLED_Pos                     0UL
#define WDT_CTL_ENABLED_Msk                     0x1UL
#define WDT_CTL_ENABLE_Pos                      31UL
#define WDT_CTL_ENABLE_Msk                      0x80000000UL
/* WDT.LOWER_LIMIT */
#define WDT_LOWER_LIMIT_LOWER_LIMIT_Pos         0UL
#define WDT_LOWER_LIMIT_LOWER_LIMIT_Msk         0xFFFFFFFFUL
/* WDT.UPPER_LIMIT */
#define WDT_UPPER_LIMIT_UPPER_LIMIT_Pos         0UL
#define WDT_UPPER_LIMIT_UPPER_LIMIT_Msk         0xFFFFFFFFUL
/* WDT.WARN_LIMIT */
#define WDT_WARN_LIMIT_WARN_LIMIT_Pos           0UL
#define WDT_WARN_LIMIT_WARN_LIMIT_Msk           0xFFFFFFFFUL
/* WDT.CONFIG */
#define WDT_CONFIG_LOWER_ACTION_Pos             0UL
#define WDT_CONFIG_LOWER_ACTION_Msk             0x1UL
#define WDT_CONFIG_UPPER_ACTION_Pos             4UL
#define WDT_CONFIG_UPPER_ACTION_Msk             0x10UL
#define WDT_CONFIG_WARN_ACTION_Pos              8UL
#define WDT_CONFIG_WARN_ACTION_Msk              0x100UL
#define WDT_CONFIG_AUTO_SERVICE_Pos             12UL
#define WDT_CONFIG_AUTO_SERVICE_Msk             0x1000UL
#define WDT_CONFIG_DEBUG_TRIGGER_EN_Pos         28UL
#define WDT_CONFIG_DEBUG_TRIGGER_EN_Msk         0x10000000UL
#define WDT_CONFIG_DPSLP_PAUSE_Pos              29UL
#define WDT_CONFIG_DPSLP_PAUSE_Msk              0x20000000UL
#define WDT_CONFIG_HIB_PAUSE_Pos                30UL
#define WDT_CONFIG_HIB_PAUSE_Msk                0x40000000UL
#define WDT_CONFIG_DEBUG_RUN_Pos                31UL
#define WDT_CONFIG_DEBUG_RUN_Msk                0x80000000UL
/* WDT.CNT */
#define WDT_CNT_CNT_Pos                         0UL
#define WDT_CNT_CNT_Msk                         0xFFFFFFFFUL
/* WDT.LOCK */
#define WDT_LOCK_WDT_LOCK_Pos                   0UL
#define WDT_LOCK_WDT_LOCK_Msk                   0x3UL
/* WDT.SERVICE */
#define WDT_SERVICE_SERVICE_Pos                 0UL
#define WDT_SERVICE_SERVICE_Msk                 0x1UL
/* WDT.INTR */
#define WDT_INTR_WDT_Pos                        0UL
#define WDT_INTR_WDT_Msk                        0x1UL
/* WDT.INTR_SET */
#define WDT_INTR_SET_WDT_Pos                    0UL
#define WDT_INTR_SET_WDT_Msk                    0x1UL
/* WDT.INTR_MASK */
#define WDT_INTR_MASK_WDT_Pos                   0UL
#define WDT_INTR_MASK_WDT_Msk                   0x1UL
/* WDT.INTR_MASKED */
#define WDT_INTR_MASKED_WDT_Pos                 0UL
#define WDT_INTR_MASKED_WDT_Msk                 0x1UL


